#Область Печать

// СтандартныеПодсистемы.ПодключаемыеКоманды
// Заполняет команды печати акта для форм документа и списка.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктПриемаПередачиПродуктов";
	КомандаПечати.Представление = НСтр("ru = 'Акт приема-передачи программных продуктов'");
	КомандаПечати.Обработчик    = "ПечатьАктовПередачиЛицензийКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаДокумента,ФормаСписка,ФормаВыбора";
	КомандаПечати.Порядок       = 10;

КонецПроцедуры

#КонецОбласти
