#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ИмяМакета) Тогда
		Возврат;
	КонецЕсли;

	МетаданныеМакета = Метаданные.Справочники.ШаблоныПередачиЛицензий.Макеты.Найти(ИмяМакета);
	Если МетаданныеМакета = Неопределено Тогда
		ИмяМакета = "";
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Наименование) Тогда
		Наименование = МетаданныеМакета.Синоним;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
